# What is Pandas?
Pandas is a Python library used for working with data sets.
It has functions for analyzing, cleaning, exploring, and manipulating data.
The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis"

# Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.Pandas can clean messy data sets, and make them readable and relevant.
Relevant data is very important in data science.

In [1]:
import numpy as np
import pandas as pd

# Series
series is basically 1 dimentional array which return data as column

In [2]:
s1=pd.Series(np.arange(10,21), name='age')
s1

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
Name: age, dtype: int32

In [3]:
s1[0]

10

In [4]:
s1.astype(np.float64) # changing data type

0     10.0
1     11.0
2     12.0
3     13.0
4     14.0
5     15.0
6     16.0
7     17.0
8     18.0
9     19.0
10    20.0
Name: age, dtype: float64

# DataFrame
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [5]:
df=pd.DataFrame(
    {
        "Age": np.arange(10,20),
        "Height": np.arange(150, 170, 2),
        "Weight": np.arange(40,60,2)
    }

)
df

   Age  Height  Weight
0   10     150      40
1   11     152      42
2   12     154      44
3   13     156      46
4   14     158      48
5   15     160      50
6   16     162      52
7   17     164      54
8   18     166      56
9   19     168      58

# Saving Data

In [6]:
df.to_csv('Students.csv') # saving data csv formate

In [7]:
# read data from csv
pd.read_csv('students.csv',index_col=0, nrows=5) # index_col= hide specific column

   Age  Height  Weight
0   10     150      40
1   11     152      42
2   12     154      44
3   13     156      46
4   14     158      48

In [8]:
df.to_json('Students.json') # saving data json formate

In [9]:
# read data from
pd.read_json('students.json')

   Age  Height  Weight
0   10     150      40
1   11     152      42
2   12     154      44
3   13     156      46
4   14     158      48
5   15     160      50
6   16     162      52
7   17     164      54
8   18     166      56
9   19     168      58

In [10]:
df.to_dict()

{'Age': {0: 10, 1: 11, 2: 12, 3: 13, 4: 14, 5: 15, 6: 16, 7: 17, 8: 18, 9: 19},
 'Height': {0: 150,
  1: 152,
  2: 154,
  3: 156,
  4: 158,
  5: 160,
  6: 162,
  7: 164,
  8: 166,
  9: 168},
 'Weight': {0: 40,
  1: 42,
  2: 44,
  3: 46,
  4: 48,
  5: 50,
  6: 52,
  7: 54,
  8: 56,
  9: 58}}

In [11]:
df.to_html('Students.html') # saving data html formate

In [12]:
# read data from html
pd.read_html('students.html')

[   Unnamed: 0  Age  Height  Weight
 0           0   10     150      40
 1           1   11     152      42
 2           2   12     154      44
 3           3   13     156      46
 4           4   14     158      48
 5           5   15     160      50
 6           6   16     162      52
 7           7   17     164      54
 8           8   18     166      56
 9           9   19     168      58]

In [13]:
df.to_xml('Students.xml') # saving data xml formate

In [14]:
pd.read_xml('students.xml')

   index  Age  Height  Weight
0      0   10     150      40
1      1   11     152      42
2      2   12     154      44
3      3   13     156      46
4      4   14     158      48
5      5   15     160      50
6      6   16     162      52
7      7   17     164      54
8      8   18     166      56
9      9   19     168      58

In [15]:
df.to_clipboard() # this method copy this table data, we can pest that data any where

In [16]:
pd.read_clipboard() # read data from clipboard()

   Age  Height  Weight
0   10     150      40
1   11     152      42
2   12     154      44
3   13     156      46
4   14     158      48
5   15     160      50
6   16     162      52
7   17     164      54
8   18     166      56
9   19     168      58

In [17]:
df.to_numpy() # Convert the DataFrame to a NumPy array.

array([[ 10, 150,  40],
       [ 11, 152,  42],
       [ 12, 154,  44],
       [ 13, 156,  46],
       [ 14, 158,  48],
       [ 15, 160,  50],
       [ 16, 162,  52],
       [ 17, 164,  54],
       [ 18, 166,  56],
       [ 19, 168,  58]])

In [18]:
df.to_numpy().dump('student.npy')

In [19]:
import openpyxl
df.to_excel('student.xlsx') # saving data into excel file

In [20]:
df.to_excel('students.xlsx', sheet_name='student') # saving data  student.xlsx file to student.xlsx

In [21]:
pd.read_excel('students.xlsx',sheet_name='student', index_col=0,skiprows=[2,5,8])

   Age  Height  Weight
0   10     150      40
2   12     154      44
3   13     156      46
5   15     160      50
6   16     162      52
8   18     166      56
9   19     168      58

In [22]:
import sqlite3 as sq 
conn= sq.connect('students.db')
cursor=conn.cursor()

df.to_sql('student', conn) # saving data into sql dbms
conn.commit()

# Load Data

In [23]:
# read sql data 
df_sql=pd.read_sql("SELECT * FROM student", conn) #
df_sql

   index  Age  Height  Weight
0      0   10     150      40
1      1   11     152      42
2      2   12     154      44
3      3   13     156      46
4      4   14     158      48
5      5   15     160      50
6      6   16     162      52
7      7   17     164      54
8      8   18     166      56
9      9   19     168      58

# web access

In [24]:
url='https://www.icc-cricket.com/rankings/mens/team-rankings/odi'
df_web=pd.read_html(url)
df_web

[    Pos                Team  T  Matches  M  Points  P  Rating  R
 0     1        New Zealand  NZ          20       2448        122
 1     2           England  ENG          32       3793        119
 2     3         Australia  AUS          31       3475        112
 3     4             India  IND          38       4162        110
 4     5       South Africa  SA          31       3167        102
 5     6          Pakistan  PAK          30       2921         97
 6     7        Bangladesh  BAN          36       3350         93
 7     8          Sri Lanka  SL          35       2835         81
 8     9        West Indies  WI          36       2788         77
 9    10       Afghanistan  AFG          23       1562         68
 10   11           Ireland  IRE          28       1445         52
 11   12          Scotland  SCO          10        452         45
 12   13          Zimbabwe  ZIM          23        951         41
 13   14       Netherlands  NED          13        459         35
 14   15               UAE  UAE          20        651         33
 15   16              Oman  OMA          24        720         30
 16   17           Namibia  NAM          13        268         21
 17   18             Nepal  NEP          17        308         18
 18   19     United States  USA          14        232         17
 19   20  Papua New Guinea  PNG          19        207         11]

In [25]:
df_web[0]

    Pos                Team  T  Matches  M  Points  P  Rating  R
0     1        New Zealand  NZ          20       2448        122
1     2           England  ENG          32       3793        119
2     3         Australia  AUS          31       3475        112
3     4             India  IND          38       4162        110
4     5       South Africa  SA          31       3167        102
5     6          Pakistan  PAK          30       2921         97
6     7        Bangladesh  BAN          36       3350         93
7     8          Sri Lanka  SL          35       2835         81
8     9        West Indies  WI          36       2788         77
9    10       Afghanistan  AFG          23       1562         68
10   11           Ireland  IRE          28       1445         52
11   12          Scotland  SCO          10        452         45
12   13          Zimbabwe  ZIM          23        951         41
13   14       Netherlands  NED          13        459         35
14   15               UAE  UAE          20        651         33
15   16              Oman  OMA          24        720         30
16   17           Namibia  NAM          13        268         21
17   18             Nepal  NEP          17        308         18
18   19     United States  USA          14        232         17
19   20  Papua New Guinea  PNG          19        207         11

In [26]:
df_web[0].to_csv('ranking.csv')

In [27]:
pd.read_csv('ranking.csv')

    Unnamed: 0  Pos                Team  T  Matches  M  Points  P  Rating  R
0            0    1        New Zealand  NZ          20       2448        122
1            1    2           England  ENG          32       3793        119
2            2    3         Australia  AUS          31       3475        112
3            3    4             India  IND          38       4162        110
4            4    5       South Africa  SA          31       3167        102
5            5    6          Pakistan  PAK          30       2921         97
6            6    7        Bangladesh  BAN          36       3350         93
7            7    8          Sri Lanka  SL          35       2835         81
8            8    9        West Indies  WI          36       2788         77
9            9   10       Afghanistan  AFG          23       1562         68
10          10   11           Ireland  IRE          28       1445         52
11          11   12          Scotland  SCO          10        452         45
12          12   13          Zimbabwe  ZIM          23        951         41
13          13   14       Netherlands  NED          13        459         35
14          14   15               UAE  UAE          20        651         33
15          15   16              Oman  OMA          24        720         30
16          16   17           Namibia  NAM          13        268         21
17          17   18             Nepal  NEP          17        308         18
18          18   19     United States  USA          14        232         17
19          19   20  Papua New Guinea  PNG          19        207         11